{
  "name": "Tavern Drinks",
  "description": "A d100 table of magical and mundane tavern drinks. Roll when a player orders something interesting at the bar!",
  "source": "Homebrew DND",
  "die": "d100",
  "homebrew": true,
  "entries": [
    { "min": 1, "max": 2, "name": "Dragon's Breath Ale", "price": "8 sp", "effect": "After drinking, you can use a bonus action to exhale fire in a 10-foot cone. Creatures must make a DC 12 Dex save or take 1d6 fire damage. Lasts 1 minute." },
    { "min": 3, "max": 4, "name": "Mindflayer's Migraine", "price": "2 gp", "effect": "A deep purple liquor. You gain telepathy out to 30 feet for 10 minutes, but have disadvantage on Wisdom saves during this time." },
    { "min": 5, "max": 6, "name": "Goodberry Wine", "price": "5 sp", "effect": "Sweet elven wine. Heals 1 hit point and counts as a full meal. Non-alcoholic despite the name." },
    { "min": 7, "max": 8, "name": "Dwarven Gutbuster", "price": "4 sp", "effect": "Thick, dark stout. DC 12 Constitution save or be poisoned for 1 hour. On a success, gain advantage on saves against fear for 1 hour." },
    { "min": 9, "max": 10, "name": "Feywild Fizz", "price": "1 gp", "effect": "A sparkling pink drink that changes flavor with each sip. Roll on the Wild Magic Surge table (no effect on non-spellcasters, just pretty sparkles)." },
    { "min": 11, "max": 12, "name": "Liquid Courage", "price": "3 sp", "effect": "Warm spiced rum. You have advantage on saves against being frightened for 1 hour, but disadvantage on Dexterity checks." },
    { "min": 13, "max": 14, "name": "Owlbear's Roar", "price": "6 sp", "effect": "Honey mead so strong it burns. Your voice becomes supernaturally loud for 10 minutes. Advantage on Intimidation checks." },
    { "min": 15, "max": 16, "name": "Shadowfell Stout", "price": "1 gp", "effect": "A pitch-black beer that absorbs light. You can see in magical darkness for 1 hour, but bright light is painful (disadvantage on attacks in bright light)." },
    { "min": 17, "max": 18, "name": "Beholder's Eye", "price": "15 gp", "effect": "A shot with a pickled eye floating in it. Gain darkvision 60 ft for 8 hours (or extend existing darkvision by 30 ft)." },
    { "min": 19, "max": 20, "name": "Troll's Blood", "price": "5 gp", "effect": "Thick green liquid. Disgusting taste. Regain 1 hit point at the start of each turn for 1 minute. Does not work if you've taken fire or acid damage." },
    { "min": 21, "max": 22, "name": "Moonshine", "price": "2 sp", "effect": "Literally glows in the dark. Provides dim light in a 5-foot radius for 1 hour after drinking." },
    { "min": 23, "max": 24, "name": "Giant's Toe", "price": "3 sp", "effect": "A massive mug of ale. DC 10 Con save or hiccup loudly every minute for an hour. On a success, you feel great!" },
    { "min": 25, "max": 26, "name": "Pixie's Promise", "price": "8 sp", "effect": "Tiny sparkling cocktail. You shrink to half your size for 10 minutes. Your equipment shrinks with you." },
    { "min": 27, "max": 28, "name": "The Flumph", "price": "4 sp", "effect": "A bubbly blue drink that makes you hover 1 inch off the ground for 10 minutes. You leave no footprints." },
    { "min": 29, "max": 30, "name": "Mimic Mimosa", "price": "7 sp", "effect": "Changes flavor and color every round. 10% chance the mug tries to bite you (1d4 piercing damage)." },
    { "min": 31, "max": 32, "name": "Lich's Last Laugh", "price": "25 gp", "effect": "Ancient whiskey with a skull-shaped ice cube. DC 15 Con save or fall unconscious for 1 minute. On success, gain resistance to necrotic damage for 1 hour." },
    { "min": 33, "max": 34, "name": "Basilisk Bourbon", "price": "3 gp", "effect": "Petrifyingly strong. DC 13 Con save or be paralyzed for 1 round as your muscles lock up." },
    { "min": 35, "max": 36, "name": "Rust Monster Rum", "price": "6 sp", "effect": "Orange-brown and fizzy. Any non-magical metal object you're holding takes 1d4 acid damage worth of corrosion." },
    { "min": 37, "max": 38, "name": "Gelatinous Cube Shot", "price": "1 gp", "effect": "A wiggly, transparent shot. Swallowing it whole grants acid resistance for 10 minutes. Chewing it deals 1d4 acid damage to your mouth." },
    { "min": 39, "max": 40, "name": "Treant's Timber", "price": "4 sp", "effect": "Tastes like maple syrup and bark. You can speak with plants for 10 minutes." },
    { "min": 41, "max": 42, "name": "Storm Giant's Tankard", "price": "2 gp", "effect": "Served in an absurdly large mug. Lightning crackles on your skin for 1 hour—creatures that touch you take 1 lightning damage." },
    { "min": 43, "max": 44, "name": "Invisible Ink", "price": "10 gp", "effect": "A clear, tasteless liquid. You become invisible for 1 minute, but the effect ends if you speak, attack, or cast a spell." },
    { "min": 45, "max": 46, "name": "Phoenix Firewater", "price": "20 gp", "effect": "Burns going down, burns coming up. If you drop to 0 HP within 1 hour, you immediately regain 1 HP. One use only." },
    { "min": 47, "max": 48, "name": "Kenku's Karaoke", "price": "5 sp", "effect": "After drinking, you can only speak by mimicking sounds you've heard in the last hour. Lasts 30 minutes." },
    { "min": 49, "max": 50, "name": "Displacer Beast Daiquiri", "price": "8 sp", "effect": "Your image shifts slightly. Attacks against you have disadvantage for 1 minute, but you have disadvantage on attacks too." },
    { "min": 51, "max": 52, "name": "Common Ale", "price": "4 cp", "effect": "Just regular ale. Nothing special, but it's cheap and refreshing." },
    { "min": 53, "max": 54, "name": "Elven White Wine", "price": "2 sp", "effect": "Crisp and elegant. No magical effects, just a pleasant evening." },
    { "min": 55, "max": 56, "name": "Halfling Cider", "price": "3 sp", "effect": "Sweet apple cider. Makes you feel like everything will work out fine. No mechanical effect, just vibes." },
    { "min": 57, "max": 58, "name": "Orcish Grog", "price": "2 sp", "effect": "Tastes terrible. DC 10 Con save or spend your next action retching. Popular with orcs for some reason." },
    { "min": 59, "max": 60, "name": "Gnomish Invention #47", "price": "1 gp", "effect": "Bright green and fizzy. Roll a d6: 1-2 you burp bubbles, 3-4 your hair stands on end, 5-6 you hiccup sparks." },
    { "min": 61, "max": 62, "name": "Siren's Song Sangria", "price": "7 sp", "effect": "Fruity and enchanting. You have advantage on Charisma (Performance) checks for 1 hour." },
    { "min": 63, "max": 64, "name": "Myconid Mushroom Tea", "price": "5 sp", "effect": "Earthy and calming. You can communicate telepathically with fungi for 1 hour. Most fungi have nothing interesting to say." },
    { "min": 65, "max": 66, "name": "Bulette Brandy", "price": "4 sp", "effect": "Strong enough to burrow through your liver. Gain tremorsense 10 ft for 10 minutes." },
    { "min": 67, "max": 68, "name": "Will-o'-Wisp Whiskey", "price": "3 gp", "effect": "Glowing ethereal spirits swirl in the bottle. You can see into the Ethereal Plane for 10 minutes." },
    { "min": 69, "max": 70, "name": "Aboleth's Memory", "price": "50 gp", "effect": "Thick, slimy, and ancient. Gain proficiency in one skill of your choice for 24 hours. DC 15 Wis save or have disturbing dreams when you sleep." },
    { "min": 71, "max": 72, "name": "Brass Dragon Brew", "price": "6 sp", "effect": "Warm and friendly. You can't stop talking for 10 minutes. Disadvantage on Stealth checks involving silence." },
    { "min": 73, "max": 74, "name": "Black Dragon Bitter", "price": "8 sp", "effect": "Extremely sour. You gain resistance to acid damage for 10 minutes." },
    { "min": 75, "max": 76, "name": "White Dragon Winter Ale", "price": "6 sp", "effect": "Served frozen. You gain resistance to cold damage for 10 minutes." },
    { "min": 77, "max": 78, "name": "Blue Dragon Bolt", "price": "1 gp", "effect": "Electric and sharp. You gain resistance to lightning damage for 10 minutes." },
    { "min": 79, "max": 80, "name": "Green Dragon Absinthe", "price": "1 gp", "effect": "Herbal and dangerous. You gain resistance to poison damage for 10 minutes." },
    { "min": 81, "max": 82, "name": "Red Dragon Reserve", "price": "2 gp", "effect": "Aged and spicy. You gain resistance to fire damage for 10 minutes." },
    { "min": 83, "max": 84, "name": "Bard's Inspiration IPA", "price": "5 sp", "effect": "Hoppy and encouraging. Once in the next hour, you can add 1d4 to an ability check." },
    { "min": 85, "max": 86, "name": "Paladin's Oath Porter", "price": "5 sp", "effect": "Rich and righteous. You cannot willingly tell a lie for 1 hour." },
    { "min": 87, "max": 88, "name": "Rogue's Reserve", "price": "7 sp", "effect": "Dark and mysterious. Advantage on Stealth checks for 10 minutes, but disadvantage on Persuasion." },
    { "min": 89, "max": 90, "name": "Wizard's Tower Toddy", "price": "1 gp", "effect": "Warm and intellectual. Advantage on Intelligence checks for 10 minutes, but disadvantage on Strength checks." },
    { "min": 91, "max": 92, "name": "Fighter's Fortitude", "price": "4 sp", "effect": "Simple and strong. Gain 1d4 temporary hit points for 1 hour." },
    { "min": 93, "max": 94, "name": "Cleric's Communion Wine", "price": "5 sp", "effect": "Blessed by a local temple. The next healing spell cast on you heals an additional 1d4 HP (within 1 hour)." },
    { "min": 95, "max": 96, "name": "Warlock's Pact Punch", "price": "6 sp", "effect": "Suspiciously good deal. Gain 2 temporary HP, but your patron knows everything you say for the next hour." },
    { "min": 97, "max": 98, "name": "Druid's Wildberry Mead", "price": "4 sp", "effect": "Sweet and natural. Animals are friendly to you for 1 hour (not hostile creatures, just beasts)." },
    { "min": 99, "max": 100, "name": "The Tarrasque", "price": "100 gp", "effect": "A legendary drink few survive. DC 18 Constitution save or fall unconscious for 8 hours. On success, gain immunity to the frightened condition for 24 hours and bragging rights forever." }
  ]
}
