{
  "name": "Tavern Events",
  "description": "What's happening when the party walks into the tavern? Roll to set the scene!",
  "source": "Homebrew DND",
  "die": "d100",
  "homebrew": true,
  "entries": [
    { "min": 1, "max": 2, "result": "A bar fight is in full swing. Chairs are flying." },
    { "min": 3, "max": 4, "result": "A bard is performing badly. The crowd is heckling mercilessly." },
    { "min": 5, "max": 6, "result": "Someone just died at their table. Nobody has noticed yet." },
    { "min": 7, "max": 8, "result": "A drinking contest is about to begin. They need one more contestant." },
    { "min": 9, "max": 10, "result": "The tavern is completely silent. Everyone stares at the party." },
    { "min": 11, "max": 12, "result": "A wedding reception is taking place. Free food and drinks!" },
    { "min": 13, "max": 14, "result": "Two wizards are having a heated magical debate. Small sparks fly." },
    { "min": 15, "max": 16, "result": "A dog is sitting at the bar, drinking from a bowl. No one questions it." },
    { "min": 17, "max": 18, "result": "The bartender is arm-wrestling customers. Undefeated so far." },
    { "min": 19, "max": 20, "result": "A shady figure in the corner keeps making eye contact with the party." },
    { "min": 21, "max": 22, "result": "Someone is reading names from a list. A few patrons look nervous." },
    { "min": 23, "max": 24, "result": "A gambling game is getting intense. Large pile of gold on the table." },
    { "min": 25, "max": 26, "result": "The tavern is hosting an arm-wrestling tournament. Prize is 50 gp." },
    { "min": 27, "max": 28, "result": "A patron is loudly complaining about the adventurers who ruined his farm." },
    { "min": 29, "max": 30, "result": "The fireplace explodes with green flame, then returns to normal. Nobody reacts." },
    { "min": 31, "max": 32, "result": "A group of off-duty guards are drinking heavily and telling war stories." },
    { "min": 33, "max": 34, "result": "Someone's pet mimic is loose. It currently looks like a barstool." },
    { "min": 35, "max": 36, "result": "A merchant is trying to sell 'genuine' magic items from a coat." },
    { "min": 37, "max": 38, "result": "Two parties of adventurers are comparing quest accomplishments loudly." },
    { "min": 39, "max": 40, "result": "The bard is singing a song about the party's recent exploits (embellished)." },
    { "min": 41, "max": 42, "result": "It's trivia night. The current question has stumped everyone." },
    { "min": 43, "max": 44, "result": "A noble is slumming it, poorly disguised, fascinated by 'common folk.'" },
    { "min": 45, "max": 46, "result": "The tavern cat is being worshipped by a group of drunk patrons." },
    { "min": 47, "max": 48, "result": "Someone just proposed marriage. Awkward silence follows." },
    { "min": 49, "max": 50, "result": "A recruitment officer is looking for soldiers. Offers decent pay." },
    { "min": 51, "max": 52, "result": "The cook has quit mid-service. The owner is desperately cooking." },
    { "min": 53, "max": 54, "result": "A wake is being held for a local legend. Stories are being shared." },
    { "min": 55, "max": 56, "result": "Two rogues are playing a very intense game of chess." },
    { "min": 57, "max": 58, "result": "A wild magic sorcerer just sneezed. Roll on Wild Magic table." },
    { "min": 59, "max": 60, "result": "The tavern is inexplicably fancy tonight. White tablecloths and candles." },
    { "min": 61, "max": 62, "result": "A fortune teller has set up in the corner. First reading is free." },
    { "min": 63, "max": 64, "result": "Someone is standing on a table giving an impassioned political speech." },
    { "min": 65, "max": 66, "result": "A group is holding an intervention for their alcoholic friend." },
    { "min": 67, "max": 68, "result": "The bouncer just threw someone through the door (from outside to inside)." },
    { "min": 69, "max": 70, "result": "A messenger rushes in with urgent news. War has been declared somewhere." },
    { "min": 71, "max": 72, "result": "Someone claims to have seen a dragon flying overhead recently." },
    { "min": 73, "max": 74, "result": "A birthday celebration is happening. The birthday person looks miserable." },
    { "min": 75, "max": 76, "result": "Two clerics of opposing gods are having a surprisingly civil drink together." },
    { "min": 77, "max": 78, "result": "The tavern is being inspected by a very uptight health official." },
    { "min": 79, "max": 80, "result": "A retired adventurer is showing off scars and telling increasingly tall tales." },
    { "min": 81, "max": 82, "result": "Someone's invisibility spell just wore off in an embarrassing location." },
    { "min": 83, "max": 84, "result": "A dwarf and an elf are bonding over their mutual hatred of someone." },
    { "min": 85, "max": 86, "result": "The tavern is hosting a 'pets allowed' night. It's chaotic." },
    { "min": 87, "max": 88, "result": "A previously banned patron is trying to sneak back in with a bad disguise." },
    { "min": 89, "max": 90, "result": "Someone just won big at gambling and is buying drinks for everyone." },
    { "min": 91, "max": 92, "result": "A wanted criminal is hiding in plain sight among the patrons." },
    { "min": 93, "max": 94, "result": "The tavern's 'house special' is glowing. The bartender insists it's normal." },
    { "min": 95, "max": 96, "result": "A secret meeting is happening in the back room. The password is obvious." },
    { "min": 97, "max": 98, "result": "Someone just challenged the party to a duel for bumping into them." },
    { "min": 99, "max": 99, "result": "A portal briefly opens, something falls through, then it closes." },
    { "min": 100, "max": 100, "result": "Roll twice. Both things are happening simultaneously." }
  ]
}