{
  "name": "Weather",
  "description": "Random weather conditions for travel, outdoor encounters, or setting the scene. Roll once per day or when conditions might change.",
  "source": "Homebrew DND",
  "die": "d100",
  "homebrew": true,
  "entries": [
    { "min": 1, "max": 3, "result": "Clear and sunny. Perfect traveling weather. No penalties." },
    { "min": 4, "max": 6, "result": "Clear skies with a gentle breeze. Pleasant and mild." },
    { "min": 7, "max": 9, "result": "Partly cloudy. Sun comes and goes throughout the day." },
    { "min": 10, "max": 12, "result": "Overcast but dry. Gray skies, diffused light." },
    { "min": 13, "max": 15, "result": "Warm and humid. Uncomfortable but manageable." },
    { "min": 16, "max": 18, "result": "Cool and crisp. Excellent visibility, invigorating air." },
    { "min": 19, "max": 21, "result": "Unusually warm for the season. Locals comment on it." },
    { "min": 22, "max": 24, "result": "Unusually cold for the season. Frost where there shouldn't be." },
    { "min": 25, "max": 27, "result": "Light wind picking up. Cloaks and loose items flutter." },
    { "min": 28, "max": 30, "result": "Strong winds. Disadvantage on ranged attacks beyond 30 ft." },
    { "min": 31, "max": 33, "result": "Gusty and unpredictable winds. Small items may blow away." },
    { "min": 34, "max": 36, "result": "Light mist. Visibility reduced to 300 feet." },
    { "min": 37, "max": 39, "result": "Morning fog burns off by midday. Early travel is slow." },
    { "min": 40, "max": 42, "result": "Thick fog. Visibility reduced to 60 feet. Easy to get lost." },
    { "min": 43, "max": 45, "result": "Light drizzle. Annoying but not dangerous." },
    { "min": 46, "max": 48, "result": "Steady rain. Exposed flames extinguished. Mud forming." },
    { "min": 49, "max": 51, "result": "Heavy rain. Disadvantage on Perception checks. Difficult terrain." },
    { "min": 52, "max": 54, "result": "Torrential downpour. Travel speed halved. Rivers may flood." },
    { "min": 55, "max": 57, "result": "Rain with distant thunder. Storm approaching or receding." },
    { "min": 58, "max": 60, "result": "Thunderstorm. Seek shelter or risk lightning (1% chance per hour)." },
    { "min": 61, "max": 63, "result": "Severe thunderstorm. Lightning strikes nearby. Very dangerous." },
    { "min": 64, "max": 66, "result": "Light snow or sleet. Ground becoming slippery." },
    { "min": 67, "max": 69, "result": "Steady snowfall. Accumulating. Tracks easy to follow." },
    { "min": 70, "max": 72, "result": "Heavy snow. Travel speed halved. Visibility 100 feet." },
    { "min": 73, "max": 75, "result": "Blizzard conditions. Travel nearly impossible. Shelter required." },
    { "min": 76, "max": 78, "result": "Freezing rain. Everything coated in ice. Extremely slippery." },
    { "min": 79, "max": 81, "result": "Hail. Seek cover or take 1 bludgeoning damage per minute." },
    { "min": 82, "max": 84, "result": "Extreme heat. CON save DC 10 every hour or gain exhaustion." },
    { "min": 85, "max": 87, "result": "Extreme cold. CON save DC 10 every hour or gain exhaustion." },
    { "min": 88, "max": 89, "result": "Sandstorm/Dust storm. Visibility 10 feet. Can't breathe without cover." },
    { "min": 90, "max": 91, "result": "Still and oppressively quiet. Animals are silent. Eerie." },
    { "min": 92, "max": 93, "result": "Beautiful rainbow after brief rain. Good omen?" },
    { "min": 94, "max": 95, "result": "Strange colored sky (red, green, purple). Unnatural feeling." },
    { "min": 96, "max": 96, "result": "Ashfall from a distant volcano or massive fire." },
    { "min": 97, "max": 97, "result": "Eclipse begins. Darkness at midday for 1d4 hours." },
    { "min": 98, "max": 98, "result": "Meteor shower visible. Beautiful and potentially ominous." },
    { "min": 99, "max": 99, "result": "Unnatural weather (raining frogs, blood-red rain, snow in summer)." },
    { "min": 100, "max": 100, "result": "Magical storm. Wild magic surges possible. Roll on Wild Magic if casting." }
  ]
}